const hatkafaExs = `# הקדמה
אז אני אספר היום על מתקפה בשם \`\`\`Faked States Attack\`\`\`
על מערכת הפצת מפתחות קוונטית. היא נורא מעניינת בעיני כי היא מראה שגם במערכות שלכאורה חסינות לחלוטין ניתן למצוא חוליה חלשה.

# מושגים בסיסיים
בעיית הפצת המפתחות:
כאשר רוצים לתקשר תחת הצפנה סימטרית (הצפנה בה המפתח הצפנה והמפתח פענוח זהים) יש צורך בהעברת המפתח בצורה מאובטחת מצד לצד כדי לאפשר את התקשורת הבטוחה - כי אחרת לא תועיל ההצפנה אם מפתח ההצפנה גלוי לכולם והם יכולים לפענח ולהצפין איתו בעצמם. קיימים פרוטוקולים רבים להפצת מפתחות, כיום משתמשים בעיקר בשיטות הצפנה א-סימטריות בשביל כך אבל אני אציג פרצה בפרוטוקול אחר המבוסס על תקשורת קוונטית.

1. **קיוביט:**
יחידת המידע המקבילה לביט במחשב קוונטי, הייחוד בה הוא שהיא לא מוגבלת לערכים 0 ו- 1 אלא יכולה להכיל גם קומבינציות שלהם. המצבים 0 ו- 1 בקיוביט מסומנים כ
<0| ו <1|
וקיוביט יכול להכיל כל ערך מהצורה:
a|0> + b|1>
כש- a וb יכולים להיות מספרים מרוכבים כל עוד
|a|^2 + |b|^2 = 1
ההגדרה מרגישה אולי טיפה שרירותית אבל בהמשך יהיה מובן יותר.

2. **מדידה קוונטית:**
לצערנו, למרות שהקיוביט יכול להכיל מספר אינסופי של ערכים לא ניתן לקבל ממנו את ערכו המדוייק אלא לקבל מידע מידע הסתברותי על הימצאותו באחד משני מצבים תוך השפעה על הקיוביט בעת המדידה:
את המדידה מבצעים מעל זוג מצבים
(לדוגמא <0| וגם <1| )
והיא מחזירה עבור כל מצב את אחד משני המצבים שלגביהם נמדד הקיוביט בהסתברות השווה לריבוע להיטל המצב הנוכחי על מצב המדידה
לדוגמא במדידה מעל הבסיס <0| וגם <1| של הקיוביט
a|0> + b|1>
תגרום להחזר מדידה 0 בהסתברות של 2^|a| ולהחזר מדידה 1 בהסתברות של 2^|b| ובנוסף לאחר המדידה מצב הקיוביט ישתנה למצב שנמדד בו כך שאם תוצאת המדידה היא 0 אז הקיוביט יהיה במצב
<0|1 + <1|0
ואם תוצאת המדידה היא 1 אז היא יהיה במצב
<0|0 + <1|1.

3. **משפט אי השכפול:**
משפט מתמטי בחישוב קוונטי האומר שאין אופציה לקחת קיוביט בודד, להפעיל עליו סדרת פעולות ולקבל שני קיוביטים בעלי אותו הערך כאשר לא היה ידוע ערכו המדוייק מראש.

\`\`\`js
console.log("hi");
\`\`\`

# מקורות להרחבה
המאמר המקורי על המתקפה
https://arxiv.org/pdf/1112.2230.pdf

מאמר על הפרוטוקול הפצת מפתחות קוונטי
https://medium.com/quantum-untangled/quantum-key-distribution-and-bb84-protocol-6f03cc6263c5

מאמר על מספר שיטות לתקיפת מערכת הפצת מפתחות קוונטית
https://pdfs.semanticscholar.org/cf6d/818105e1027ddf7f9c9852da18fc4cdbca51.pdf

# המתקפה
המתקפה מבוססת על העובדה שהתקשורת מבוססת על פוטונים ועל כך שחיישני מדידה של bob מוכוונים למדוד פוטונים בודדים במרווחים אבל כאשר שולחים אליהם רצף ארוך ללא הפסקה של אור ניתן "לעוור" אותם ולגרום להם להתנהג כקולטנים קלאסיים ולא קוונטים.
איב עומדת בדרך בין אליס לבוב ומודדת כל פוטון שהיא מקבלת, אך במקום לשלוח את המצב כמו שהיא קיבלה אותו כמצב קוונטי היא שולחת מצב קלאסי תואם כפעימה ארוכה ולא כפוטון בודד כך שאם בוב יבחר בסיס תואם לשלה הוא יקבל את הערך שהיא מדדה, אך אם הוא ימדוד בבסיס השני הוא לא יתפוס שום מידע מאחר שלא נשלח מצב קוונטי שיגרום לאקראיות אלא מצב קלאסי שיגרום רק לאחד החיישנים לפעול וכך איב תוכל להיות מודעת לכל המצבים שבוב בחר מאחר שרק כאשר הם בחרו אותו מצב בוב יוכל לתפוס מידע. נראה לכאורה שכך אליס תבחין בחוסר אבל בגלל שפוטון בודד בכל מקרה נתקל בדרך בקשיים ועלול להעילם בכל מקרה רבים מהפוטונים מתפספסים בדרך ורק מאלו שהגיעו בונים את מפתח ההצפנה וכך אליס לא תבחין בכך שבוב לא זיהה הרבה מהמצבים שלה ותייחס זאת לרעש בתווך למשל.

# הגנה
ישנם מספר דרכים להגן מפני המתקפה, הדרך הכי פשוטה היא להוסיף חיישן אצל בוב שייוודא שלא מגיע רצף ארוך של אור המנסה "לעוור" את החיישנים. דרך נוספת היא הפעלת טרנספורמציה על כל פוטון בשני הצדדים (אליס מפעילה אצלה, אחר כך בוב מפעיל כשמגיע אליו ושולח בחזרה לאליס, היא מפעילה אצלה את הטרנספורמציה ההפוכה לזו שהיא הפעילה בתחילה ושולחת לבוב המפעיל טרנספורמציה הפוכה לזו שלו ונשאר אצלו הפוטון בעל הערך הרצוי, כפרוטוקול דומה לנעילת תיבה עם מנעול של כל אחד מהצדדים מי שמכיר)  כך שלבסוף מגיע הערך הרצוי  אל בוב אך מדידה של איב אמצע לא תתן לה את הערך האמיתי.

# סיכום
ראינו כיצד פועלים קיוביטים וכיצד פועל פרוטוקול bb84 להפצת מידע קוונטית. לאחר מכן ראינו איך ניתן בעזרת פגיעה פיזיקלית בחיישנים של הצד שמקבל את המידע לכפות עליו תוצאה של ערכים רצויים ולבסוף ראינו שתי שיטות להתגונן נגד מתקפה זו.`;

export default hatkafaExs;
