const hatkafaExs = `-הקדמה-
שבת בבוקר, יום יפה
אמא שותה המון קפה
אבא בודק אם בנו צופה בפÎרİɹ

אז איך האבא היקר שלנו יכול לבדוק אם בנו צופה בǝורƚɹ?
הוא יכול לעקוף את הסיסמה למחשב ה-Windows של הבן שלו.

קיצר, Enough with the storytelling 🥴 אז תכלס מה זה Windows Utilman Attack?

-הקדמה Windows Utilman Attack-
התקפה זו היא מאוד מאוד קלילה ופשוטה, ומשום מה היא לא מוכרת בכלל 🤷‍♂️ (לא לעוד הרבה זמן).
יש מצב שאתם מכירים כבר את Utilman.exe, כלי הנגישות של Windows. בתקיפה זו, ננצל את העובדה שניתן להפעיל את ה-Utilman במסך הנעילה (ראו תמונה 1), ונעבוד על מערכת ההפעלה, כך שנוכל לקבל גישה לכלי ה-CMD ממסך הנעילה ולשנות את הסיסמה של כל משתמש שנבחר.

-הרעיון מאחורי התקיפה-
בתקיפה זו, אנו מנצלים את מנגנון הפעולה של Windows בעת שימוש בכלי ה-Utilman.exe במסך הנעילה. כאשר אנו לוחצים על כפתור ה-Ease of Access, מערכת ההפעלה מריצה קובץ בשם Utilman.exe שממוקם בתיקיית System32. בעזרת מגנון הפעולה הזה ניתן להחביא את cmd.exe תחת שם בדוי - Utilman.exe והוא זה שיורץ כשהמחשב יעלה וכך להריץ כל פקודה שנרצה בזמן שהמחשב נעול.
בעזרת ה-CMD ניתן לגשת לחלון בו ניתן לשנות את פרטי כל המשתמשים על המחשב, משמע ניתן לפרוץ או לנעול משתמשים כרצוננו.

-התקיפה-
נתקין התקנת Windows10 או Windows11 על כונן USB (ראו עוד בקישור) מבעוד מועד. אנחנו משתמשים בהתקנת Windows חיצונית על מנת שנוכל לשנות ערכים בתיקיית System32 בקלות וללא צורך בגישה למשתמשים ב-  Windows שמותקן במחשב

ניכנס ל-BIOS במחשב שבו אנו רוצים לתקוף ונבצע boot מכונן הUSB שלנו (ראו תמונה 2). כדי לפתוח CMD בחלון ההתקנה, נלחץ Shift + F10 (יש גם דרך נוספת שמפורטת במדריך המצורף) ונריץ את רשימת הפקודות הללו:
C:
cd C:indowsystem32
copy cmd.exe cmd1.exe
rename Utilman.exe Utilman1.exe
rename cmd.exe Utilman.exe
הסבר לפקודות שרשומות:
1) שימוש בכונן C
2) כניסה לתיקיית System32
3) שמירת גיבוי של קובץ ה-CMD בתור cmd1.exe
4) שינוי השם המקורי של ה-Utilman.exe ל-Utiman1.exe. השם Utilman.exe יהיה השם של קובץ CMD
5) שינוי השם של ה-CMD המקורי ל-Utilman - הסוואה של CMD תחת השם Utiman

אוסיף כי יש לשנות את שם הכונן לשם הכונן שעליו מותקנת מערכת ההפעלה - כדי שהשינויים יחולו על מערכת ההפעלה שמותקנת על המחשב. ניתן לבדוק היכן מותקנת מערכת ההפעלה בעזרת DISKPART. לצורך ההדגמה, נשתמש בכונן C.

הסבר קצרצר על Diskpart:
התוכנה Diskpart הכי כלי CLI מובנה ל-Windows שמכיל מגוון יכולות לעבודה ומניפולציה על כוננים ומחיצות במחשב (ראו קישור להרחבה בנושא ולרפרנס לפקודות השונות).

עכשיו, ניכנס שוב ל-BIOS ונבצע BOOT ל-Windows המקורי (שאליו רוצים לפרוץ). במסך הנעילה של המשמש שאליו רוצים לפרוץ, נלחץ על כפתור ה-Ease Of Access ויפתח לנו חלון CMD (במקום Utilman) - זכרו, החבאנו את קובץ ה-CMD תחת השם Utiman.
עכשיו יש לנו את היכולת לשנות את הסיסמה של משתמשים בעזרת הפקודה:
control userpasswords2
יפתח לנו חלון שבו נוכל לשנות את פרטי המשתמשים במחשב וזה ובכך ניתן לשנות את הסיסמאות לכל סיסמה שנבחר (ראו תמונה 3).

הסבר על הפקודה control:
הפקודה מאפשרת לפתוח כלים של Control Panel מה-CMD ובקלות. פקודה זו מקלה על שימוש בכלים של Control Panel ומקצרת את תהליך הגישה אליהם, כך שניתן לעבוד עם כל ה-Control Panel בעזרת פקודה זו (ראו קישור להרחבה בנושא).

הסבר על הפקודה control userpasswords2:
פקודה זו משתמשת בכלי של ה-Control Panel שמאפשר לערוך פרטי משתמשים. שימוש בפקודה זו פותח חלון המאפשר לערוך את פרטי המשתמשים שעל המחשב, ובגלל שהצלחנו להגיע לכלי זה, אנו יכולים לשנות את פרטי המשתמשים על המחשב.

-הגנה-
רצוי מאוד להפעיל Secure Boot ולנעול את ה- BIOS עם סיסמה, כך שלא יהיה ניתן לשנות שום הגדרה ללא הזדהות. כך לא יהיה ניתן לבצע boot מהתקני USB חיצוניים והרבה יותר קשה לשנות ערכים בתיקיית System32.

-סיכום-
אז תכלס, ניצלנו את העובדה שניתן לגשת לכלי ה-Utilman והחבאנו את ה-CMD בתור שם בדוי, כך שהרצת Utilman.exe היא בעצם הרצה של cmd.exe, שניתן באמצעותו בין היתר לשנות פרטי משתמשים בקלות וכך להיכנס פנימה.

-מקורות והרחבות-

התקנת Windows 11:
https://www.microsoft.com/software-download/windows11

כלי ה-Diskpart:
https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/diskpart

פקודת ה-control:
https://www.repairwin.com/how-to-open-any-control-panel-applet-with-a-command-list-of-commands-for-control-panel-applets/

הסבר מפורט על ההתקפה (עם דרך מעט שונה, אבל העקרון זהה):
https://infinitelogins.com/2020/01/13/how-to-sign-into-any-windows-machine-when-you-have-physical-access/

סרטון הדגמה:
https://youtu.be/A565BO0p5Yw`;

export default hatkafaExs;
